interaction_criticism_reflection.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Interaction Criticism Reflection</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Interaction Criticism Reflection"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-02-04 Tue"/>
<meta name="author" content="Jacob Håkansson"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="//netdna.bootstrapcdn.com/bootstrap/3.0.3/css/bootstrap.min.css" /><meta name="viewport" content="initial-scale = 1.0,maximum-scale = 1.0" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Interaction Criticism Reflection</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">What does the author mean by interaction criticism?</h2>
<div class="outline-text-2" id="text-1">

<p>The author tries to convince us that the interaction design community
is far too focused on scientific evaluation of interactions. He
thinks that we should practice criticism more like the way an art
or food critic would do it. He points out that this should be made by
professionals. He draws parallels to the fields of humanities and
aesthetics. He proposes a framework for practicing this criticism in
the form of four perspectives:
</p><ul>
<li>Interaction designer
</li>
<li>Interface
</li>
<li>User
</li>
<li>Social context
</li>
</ul>

<p>Not all of the perspectives needs to be explored.
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Why is it relevant to interaction designers?</h2>
<div class="outline-text-2" id="text-2">

<p>Because interaction design is an art-form. User experience is
particularly hard to measure objectively. An interface is more than
presenting information and processes efficiently, it gives rise to
feelings in the user. Learning to be aware of how designs affect the
consciousness can only lead to progress. Criticism is a way of
teaching each other.
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">What do you find most interesting with it?</h2>
<div class="outline-text-2" id="text-3">

<p>Description versus interpretation might just be the most useful
distinction the author makes in the paper. That is the core of what
makes criticism not just a bunch of subjective opinions.
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Was it something you didn't like, didn't understand, or disagree with in the text?</h2>
<div class="outline-text-2" id="text-4">

<p>Disclaimer: The following is not criticism, it's a rant.
</p>
<p>
The paper was a painful read. Don't get me wrong, I agree with the
author's sentiment. It's just the way he formulates it that's abhorrent. He
repeats himself over and over, just using different words. He comes
off as pompous and self-indulgent. It's just too many words to
describe simple ideas. Even the bullet points of his framework fails
to convey any meaning. They give a sense of "what" but not "how" or
"why", they should have at least given some idea of the "how". He fails
miserably at succinctness, when he is brief he fails to convey
meaning, when he tries to explain he spreads it out of two pages.
</p>
<p>
Seldom have I come across a piece of text that have made me feel this
way. How every single section of the article wasn't edited to half
its length is a mystery to me.
</p>
<p>
I have some restrictions regarding several of the topics he brings
up, simply because he fails to show their relevance. I <span style="text-decoration:underline;">know</span> they
might be relevant, but he doesn't justify them.
</p>
<p>
I could go on like this for another page, but for everyone's sake
I'll stop here. I've conveyed my opinion.
</p></div>
</div>
</div>

<div id="postamble">
<p class="author">Author: Jacob Håkansson (<a href="mailto:jacobhak@kth.se">jacobhak@kth.se</a>)</p><p class="date">Date: 2014-02-04 Tue</p>
</div>
</body>
</html>
